public static class ReplicasClass
{
    public static string[] TextRandom =
    {
        "Мой друг не мог покончить с собой! Я в это не верю! Нужно осмотреть весь дом и найти настоящую причину смерти",
        "Я знал его слишком хорошо, чтобы поверить в самоубийство. Никаких проблем с законом, девушками или деньгами",
        "Его звали ИМЯ - душа компании, любимец девушек и просто красавец. Он был одним из лучших SMM-менеджеров в городе",
        "Боюсь, что мне не хватит оставшегося дня, чтобы прошерстить каждый уголок его особняка. Нужно остаться на ночь",
        "Чем же ты тут занимался, ИМЯ..."
    };

    public static string[] TextHide =
    {
        "Что за чёрт!? Что это было? Это не человек!",
        "Кажется, я схожу с ума или это галлюцинации..."
    };

    public static string[] Repl0 =
    {
        "Кажется, у ИМЯ были от меня секреты, рассказывать которые он не собирался",
        "Как это связано с ИМЯ? Я пока не до конца понимаю",
        "Что же это может значить?"
    };
    public static string[] Repl1 =
    {
        "2 набор реплик - 1",
        "2 набор реплик - 2",
        "2 набор реплик - 3"
    };
    public static string[] Repl2 =
    {
        "3 набор реплик - 1",
        "3 набор реплик - 2",
        "3 набор реплик - 3"
    };
    public static string[] Repl4 =
    {
        "4 набор реплик - 1",
        "4 набор реплик - 2",
        "4 набор реплик - 3"
    };

    public static string[][] TextInsidials = { Repl0, Repl1, Repl2, Repl4 };

    public static int TextRandomLength, TextHideLength, TextInsidialsLength, ReplLength;

}
