public static class ReplicasClass
{
    public static string[] TextRandom =
    {
        "Мой друг не мог покончить с собой! Я в это не верю! Нужно осмотреть весь дом и найти настоящую причину смерти.",
        "Я знал его слишком хорошо, чтобы поверить в самоубийство. Никаких проблем с законом, девушками или деньгами.",
        "Его звали Ник - душа компании, любимец девушек и просто красавец. Он был одним из лучших SMM-менеджеров в городе.",
        "Боюсь, что мне не хватит оставшегося дня, чтобы прошерстить каждый уголок его особняка. Нужно остаться на ночь.",
        "Чем же ты тут занимался, Ник...",
        "Кажется, у Ника были от меня секреты, рассказывать которые он не собирался.",
        "Как это связано с Ником? Я пока не до конца понимаю.",
        "Что же это может значить?"
    };

    public static string[] TextHide =
    {
        "Что за чёрт!? Что это было? Это не человек!",
        "Кажется, я схожу с ума или это галлюцинации...",
        "Это какие-то мистические сущности, неужели они существуют?!",
        "Нужно отдышаться и идти дальше.",
        "Ну кто придумал этих тварей?..",
        "Если я их не вижу, видят ли они меня?..",
        "Нужно следить за уровнем рассудка!"
    };

    public static string[] Repl0 =
    {
        "Красивый камень. Что это? Малахит? Изумруд? Эх, чего гадать, если я всё равно не разбираюсь.",
        "На нём какие-то руны? Защитные что ли? Ну раз так, то посмотрим, на что он способен.",
        "У него цепочка... Ну нет, я на шею его не надену, мало ли что. Положу амулет в карман."
    };
    public static string[] Repl1 =
    {
        "Одновременно жуткая и красивая обложка. Интересно, что в этой книге?",
        "Кажется, это гримуар: что-то вроде сборника фантастических тварей и мест их обитания.",
        "Это может оказаться полезным, нужно обязательно прочитать его."
    };
    public static string[] Repl2 =
    {
        "А вот и ключ, про который говорил Ник. Чувствую себя Буратино. Хаха.",
        "Жаль, что он не сказал, от чего этот ключ. Ну ладно, может пригодится.",
        "Может он как-то связан с потайной дверью и библиотекой? Надо это проверить."
    };
    public static string[] Repl3 =
    {
        "Заигрался? Предупреждали? Не приведёт? Что-то делать? Что здесь, чёрт возьми, произошло?!",
        "Кажется, Ник связался с плохой компанией... А может проиграл всё в казино... Нет, всё это на него не похоже.",
        "Нужно продолжать поиски, пока что я ничего не понимаю, но я соберу этот пал. Я обязан!"
    };
    public static string[] Repl4 =
    {
        "Что же ты такого мог натворить... Не человека же ты убил или сотню людей? Что нельзя исправить?",
        "Забавно, что он обо мне вспомнил. Подсказки - это записки? Сколько же ты их оставил?",
        "А последствия, Ник, мне уже не нравятся, но молодец, что задумался об этом, хоть и поздно. Да..."
    };
    public static string[] Repl5 =
    {
        "Я не могу тебя не простить, Ник... Ты был мне как брат... Что ж, значит увидимся с тобой уже в аду.",
        "Магия? Она существует? Что за бред? Кто-то Гарри Поттера начитался. Хотя ты слишком серьёзен, что бы шутить со мной...",
        "Предположим, что это всё правда, в таком случае, кого он выпустил? Голем? Гном? Гоблин? Орк? Вариантов тысячи..."
    };
    public static string[] Repl6 =
    {
        "Съедают рассудок? Это значит, что я тоже в опасности и могу сойти с ума? Да плевать, прорвёмся, всегда прорывались!",
        "Он сказал об экзорцизме... Изгнание демонов? После увеиденного ночью я даже готов в это поверить.",
        "Если в доме есть амулет, который поможет мне выжить и разгадать загадку, я просто обязан его найти!"
    };
    public static string[] Repl7 =
    {
        "Значит в доме есть потайная дверь... Нужно будет хорошенько осмотреть спальню.",
        "Какой ключ? От чего? Где? Я что похож на гадалку или экстрасенса? И как я должен его искать?",
        "Так, соберись! Он явно преувеличил мои умственные способности, но разве нужен высокий интеллект, чтобы обыскать дом?"
    };
    public static string[] Repl8 =
    {
        "Это был вопрос? Конечно живой, куда я тут уже денусь.",
        "Что значит сразу пойму какую? Опять загадки... Хорошо, разберёмся. Надо двигаться в библиотеку.",
        "Чёрт, Ник, почему нельзя сразу сказать, что за книга и как она мне поможет?!"
    };
    public static string[] Repl9 =
    {
        "Так значит он не шутил, когда говорил про магию. Прости, что не поверил тебе сразу, Ник.",
        "Можешь больше? По воде ходить и в вино её превращать? Хаха. Чёрт, извини ещё раз, не сдержался.",
        "А о каких сделках речь? Неужели с Дьяволом... Шутка про Бога оказалась как нельзя кстати."
    };
    public static string[] Repl10 =
    {
        "Закон равноценного обмена в алхимии? Это разве не законы сохранения массы и энергии в физике?",
        "Братья Элрики... Это не те парни, где один был цельнометаллический... или он был стальной... я уже и не помню.",
        "Ладно, это не так важно, куда важнее, чем же заплатил за эту магию Ник."
    };
    public static string[] Repl11 =
    {
        "Что такое ты делал, что отдал жизнь за это?! Иронично? Ты при смерти шутить умудрился? Мне б твою уверенность...",
        "Ох, такое простое, но такое сложное при текущих обстоятельствах желание, друг мой.",
        "Я бы сказал, что исполню его желание... Но после сегодняшней ночи я в этом уже не уверен..."
    };
    public static string[] Repl12 =
    {
        "Да, Ник, ты всегда был мастер сказать что-то мотивирующее... *улыбнулся*",
        "Это ты сам придумал? Или это цитата из какого-нибудь фильма или аниме?",
        "Я выбирусь! Я выбирусь отсюда живым! Я верю в твою веру в меня! И всё-таки классная фраза..."
    };

    public static string[][] TextInsidials = { Repl0, Repl1, Repl2, Repl3, Repl4, Repl5, Repl6, Repl7, Repl8, Repl9, Repl10, Repl11, Repl12};

    public static int TextRandomLength, TextHideLength, TextInsidialsLength, ReplLength;

}
